{
    "architectures": [
        "ErnieForCausalLM"
    ],
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 8192,
    "intermediate_size": 28672,
    "initializer_range": 0.00482174,
    "max_sequence_length": 131072,
    "max_position_embeddings": 131072,
    "model_type": "ernie",
    "model_name": "chat",
    "num_attention_heads": 64,
    "num_key_value_heads": 8,
    "num_hidden_layers": 54,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-05,
    "use_cache": false,
    "vocab_size": 103424,
    "rope_theta": 500000,
    "use_rmsnorm": true,
    "fuse_rms_norm": true,
    "use_bias": false,
    "use_fast_ln": true,
    "fuse_linear": false,
    "fuse_rope": true,
    "fuse_swiglu": true,
    "fuse_gate_detach_matmul": true,
    "moe_num_experts": 64,
    "moe_layer_start_index": 3,
    "moe_intermediate_size": 3584,
    "moe_capacity": [
        64,
        64,
        64
    ],
    "moe_gate": "top2_fused",
    "moe_k": 8,
    "moe_aux_loss_lambda": 1e-5,
    "moe_group_orthogonal_loss": true,
    "moe_orthogonal_loss_lambda": 0.0,
    "moe_z_loss_lambda": 0.0,
    "moe_layer_interval": 1,
    "moe_use_aux_free": true
}